/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Toimintoa ei voitu suorittaa loppuun";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Tapahtui tuntematon virhe (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Toimintoa ei voida viimeistellä";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Yritä myöhemmin uudelleen.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Ei voida tallentaa";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Yritä tallennusta uudelleen.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Ei voida tallentaa";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Pysäytä muut toiminnot, joita %@ käyttää ja yritä uudelleen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Ei voida tallentaa";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Yritä tallennusta uudelleen.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Yritä tallennusta uudelleen.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Ei riittävästi tilaa tiedoston kirjoittamisen jatkamiseksi. Saat lisätilaa poistamalla olemassa olevia videoita tai kuvia.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Yritä tallennusta uudelleen.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Yritä tallennusta uudelleen.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Tallenne saavutti suurimman sallitun pituuden."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Tallenne saavutti suurimman sallitun tiedostokoon."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Pysäytä toiminnot, jotka käyttävät tallennuslaitetta ja yritä uudelleen.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Tallenne saavutti suurimman sallitun pituuden."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Ei voida tallentaa";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Yritä tallennusta uudelleen.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "%@ ei käytettävissä"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Pysäytä muut toiminnot, joita %@ käyttää ja yritä uudelleen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "%@ ei käytettävissä"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Pysäytä muut toiminnot, joita %@ käyttää ja yritä uudelleen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Tallennus pysäytetty";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Pysäytä toiminnot, jotka käyttävät tallennuslaitetta ja yritä uudelleen.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_Description" = "Valaisinta ei voitu laittaa päälle.";
"AVFoundationErrorDomain_AVErrorTorchLevelUnavailable_RecoverySuggestion" = "Yritä laittaa valaisin päälle alemmalla tasolla.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Toimintoa ei voida viimeistellä";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Yritä myöhemmin uudelleen.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Vientiä ei voida viimeistellä";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Yritä viedä uudelleen.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Ei voida purkaa";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Mediadataa ei voitu purkaa. Se saattaa olla vioittunut.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Tätä mediamuotoa ei tueta.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Ei voida tallentaa";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Yritä tallentaa uudelleen.";

"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_Description" = "Tiedostoa ei voida kirjoittaa";
"AVFoundationErrorDomain_AVErrorInvalidOutputURLPathExtension_RecoverySuggestion" = "Muuta tiedostotarkennetta ja yritä uudelleen.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Mediaa ei voida käyttää.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Mediaa ei voida käyttää.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Mediaa ei voida käyttää.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Mediaa ei voida käyttää.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Tätä mediamuotoa ei tueta.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Media saattaa olla vahingoittunut.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Kuvaa ei voida ottaa";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Yritä ottaa kuva uudelleen.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Toiminto ei tue suojattua sisältöä."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Sisältöä ei ole valtuutettu."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Ohjelma ei ole valtuutettu toistamaan tätä tiedostoa."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Mediaa ei voida käyttää.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Ei voida purkaa";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Median vaatimaa purkajaa ei löytynyt.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Ei voida koodata";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Median vaatimaa koodainta ei löytynyt.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Ei voida purkaa";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Median vaatima purkaja on varattu.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Pysäytä toiminnot, jotka purkavat mediaa ja yritä uudelleen.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Ei voida koodata";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Median vaatima koodain on varattu.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Pysäytä toiminnot, jotka koodaavat mediaa ja yritä uudelleen.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "%@ ei käytettävissä"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@ ei voi olla taustalla käynnissä olevan ohjelman käytössä."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Toiminto ei tue tätä mediaa.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Videota ei voitu luoda annettujen ohjeiden mukaisesti.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Mediaa ei voida käyttää.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Välimuistitiedostoa hakuosoitteessa ei voida käyttää.";

"AVFoundationErrorDomain_AVErrorFileChecksumFailed_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorFileChecksumFailed_FailureReason" = "Tiedoston tarkiste on virheellinen.";

"AVFoundationErrorDomain_AVErrorOperationInterrupted_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorOperationInterrupted_RecoverySuggestion" = "Lopeta muut toiminnot ja yritä uudelleen.";

"AVFoundationErrorDomain_AVErrorIncompatibleAsset_Description" = "Ei voida avata";
"AVFoundationErrorDomain_AVErrorIncompatibleAsset_FailureReason" = "Mediaa ei voida käyttää tässä laitteessa.";

"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorFailedToLoadMediaData_FailureReason" = "Media saattaa olla vahingoittunut.";

"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_Description" = "Toiminto keskeytetty";
"AVFoundationErrorDomain_AVErrorServerIncorrectlyConfigured_FailureReason" = "Palvelinta ei ole määritetty oikein.";
